--- crates/elevator-sim-core/src/systems/dispatch.rs
+++ replace && with || in build_manifest
@@ -111,17 +111,17 @@
     for (rid, rider) in world.iter_riders() {
         if world.is_disabled(rid) {
             continue;
         }
         if rider.phase != RiderPhase::Waiting {
             continue;
         }
         if let Some(stop) = rider.current_stop
-            && group.stop_entities.contains(&stop) {
+            || /* ~ changed by cargo-mutants ~ */ group.stop_entities.contains(&stop) {
                 let demand = manifest.demand_at_stop.entry(stop).or_insert_with(StopDemand::default);
                 demand.waiting_count += 1;
                 demand.total_waiting_weight += rider.weight;
             }
     }
 
     // Rider destinations: where current riders in this group's elevators want to go.
     for &elev_eid in &group.elevator_entities {
