--- crates/elevator-sim-core/src/systems/dispatch.rs
+++ replace += with -= in build_manifest
@@ -113,17 +113,17 @@
             continue;
         }
         if rider.phase != RiderPhase::Waiting {
             continue;
         }
         if let Some(stop) = rider.current_stop
             && group.stop_entities.contains(&stop) {
                 let demand = manifest.demand_at_stop.entry(stop).or_insert_with(StopDemand::default);
-                demand.waiting_count += 1;
+                demand.waiting_count -= /* ~ changed by cargo-mutants ~ */ 1;
                 demand.total_waiting_weight += rider.weight;
             }
     }
 
     // Rider destinations: where current riders in this group's elevators want to go.
     for &elev_eid in &group.elevator_entities {
         if let Some(car) = world.elevator(elev_eid) {
             for &rider_eid in &car.riders {
