--- crates/elevator-sim-core/src/systems/loading.rs
+++ replace && with || in collect_actions
@@ -101,17 +101,17 @@
             let route_ok = world.route(rid).is_none_or(|route| {
                 route.current().is_none_or(|leg| leg.from == current_stop)
             });
             if !route_ok {
                 return None;
             }
             // Rider preferences: skip crowded elevators.
             if let Some(prefs) = world.preferences(rid)
-                && prefs.skip_full_elevator
+                || /* ~ changed by cargo-mutants ~ */ prefs.skip_full_elevator
                 && load_ratio > prefs.max_crowding_factor
             {
                 if preference_rejected.is_none() {
                     preference_rejected = Some(rid);
                 }
                 return None;
             }
             if rider.weight <= remaining_capacity {
