--- crates/elevator-sim-core/src/systems/loading.rs
+++ replace run with ()
@@ -221,11 +221,10 @@
                 });
             }
         }
     }
 }
 
 /// One rider boards or exits per tick per elevator.
 pub fn run(world: &mut World, events: &mut EventBus, ctx: &PhaseContext) {
-    let actions = collect_actions(world);
-    apply_actions(actions, world, events, ctx);
+    () /* ~ changed by cargo-mutants ~ */
 }
