--- crates/elevator-sim-core/src/systems/loading.rs
+++ replace != with == in collect_actions
@@ -46,17 +46,17 @@
 
     for &eid in &elevator_ids {
         if world.is_disabled(eid) {
             continue;
         }
         let Some(car) = world.elevator(eid) else {
             continue;
         };
-        if car.phase != ElevatorPhase::Loading {
+        if car.phase == /* ~ changed by cargo-mutants ~ */ ElevatorPhase::Loading {
             continue;
         }
 
         let pos = world.position(eid).map_or(0.0, |p| p.value);
         let Some(current_stop) = world.find_stop_at_position(pos) else {
             continue;
         };
 
