--- crates/elevator-sim-core/src/systems/loading.rs
+++ replace > with < in collect_actions
@@ -77,17 +77,17 @@
                 elevator: eid,
                 stop: current_stop,
             });
             continue;
         }
 
         // Single pass: find a boardable rider (fits by weight) or a rejectable one (doesn't fit).
         let remaining_capacity = car.weight_capacity - car.current_load;
-        let load_ratio = if car.weight_capacity > 0.0 {
+        let load_ratio = if car.weight_capacity < /* ~ changed by cargo-mutants ~ */ 0.0 {
             car.current_load / car.weight_capacity
         } else {
             1.0
         };
         let mut rejected_candidate: Option<EntityId> = None;
         let mut preference_rejected: Option<EntityId> = None;
 
         let board_rider = world.iter_riders().find_map(|(rid, rider)| {
