--- crates/elevator-sim-core/src/systems/movement.rs
+++ replace == with != in run
@@ -58,17 +58,17 @@
                 (old_pos, new_pos)
             } else {
                 (new_pos, old_pos)
             };
             if let Some(sorted) = world.resource::<SortedStops>() {
                 let start = sorted.0.partition_point(|&(p, _)| p <= lo + 1e-9);
                 let end = sorted.0.partition_point(|&(p, _)| p < hi - 1e-9);
                 for &(_, stop_eid) in &sorted.0[start..end] {
-                    if stop_eid == target_stop_eid {
+                    if stop_eid != /* ~ changed by cargo-mutants ~ */ target_stop_eid {
                         continue;
                     }
                     events.emit(Event::PassingFloor {
                         elevator: eid,
                         stop: stop_eid,
                         moving_up,
                         tick: ctx.tick,
                     });
