--- crates/elevator-sim-core/src/systems/dispatch.rs
+++ replace build_manifest -> DispatchManifest with Default::default()
@@ -100,40 +100,10 @@
                 }
             }
         }
     }
 }
 
 /// Build a dispatch manifest summarizing demand and rider destinations for a group.
 fn build_manifest(world: &World, group: &ElevatorGroup) -> DispatchManifest {
-    let mut manifest = DispatchManifest::default();
-
-    // Demand: riders waiting at this group's stops.
-    for (rid, rider) in world.iter_riders() {
-        if world.is_disabled(rid) {
-            continue;
-        }
-        if rider.phase != RiderPhase::Waiting {
-            continue;
-        }
-        if let Some(stop) = rider.current_stop
-            && group.stop_entities.contains(&stop) {
-                let demand = manifest.demand_at_stop.entry(stop).or_insert_with(StopDemand::default);
-                demand.waiting_count += 1;
-                demand.total_waiting_weight += rider.weight;
-            }
-    }
-
-    // Rider destinations: where current riders in this group's elevators want to go.
-    for &elev_eid in &group.elevator_entities {
-        if let Some(car) = world.elevator(elev_eid) {
-            for &rider_eid in &car.riders {
-                if let Some(route) = world.route(rider_eid)
-                    && let Some(dest) = route.current_destination() {
-                        *manifest.rider_destinations.entry(dest).or_default() += 1;
-                    }
-            }
-        }
-    }
-
-    manifest
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
