--- crates/elevator-sim-core/src/systems/dispatch.rs
+++ replace != with == in build_manifest
@@ -107,17 +107,17 @@
 fn build_manifest(world: &World, group: &ElevatorGroup) -> DispatchManifest {
     let mut manifest = DispatchManifest::default();
 
     // Demand: riders waiting at this group's stops.
     for (rid, rider) in world.iter_riders() {
         if world.is_disabled(rid) {
             continue;
         }
-        if rider.phase != RiderPhase::Waiting {
+        if rider.phase == /* ~ changed by cargo-mutants ~ */ RiderPhase::Waiting {
             continue;
         }
         if let Some(stop) = rider.current_stop
             && group.stop_entities.contains(&stop) {
                 let demand = manifest.demand_at_stop.entry(stop).or_insert_with(StopDemand::default);
                 demand.waiting_count += 1;
                 demand.total_waiting_weight += rider.weight;
             }
