--- crates/elevator-sim-core/src/systems/dispatch.rs
+++ replace && with || in build_manifest
@@ -123,17 +123,17 @@
             }
     }
 
     // Rider destinations: where current riders in this group's elevators want to go.
     for &elev_eid in &group.elevator_entities {
         if let Some(car) = world.elevator(elev_eid) {
             for &rider_eid in &car.riders {
                 if let Some(route) = world.route(rider_eid)
-                    && let Some(dest) = route.current_destination() {
+                    || /* ~ changed by cargo-mutants ~ */ let Some(dest) = route.current_destination() {
                         *manifest.rider_destinations.entry(dest).or_default() += 1;
                     }
             }
         }
     }
 
     manifest
 }
