--- crates/elevator-sim-core/src/systems/dispatch.rs
+++ replace == with != in run
@@ -60,17 +60,17 @@
 
                     events.emit(Event::ElevatorAssigned {
                         elevator: eid,
                         stop: stop_eid,
                         tick: ctx.tick,
                     });
 
                     // Already at this stop — open doors directly.
-                    if current_stop == Some(stop_eid) {
+                    if current_stop != /* ~ changed by cargo-mutants ~ */ Some(stop_eid) {
                         events.emit(Event::ElevatorArrived {
                             elevator: eid,
                             at_stop: stop_eid,
                             tick: ctx.tick,
                         });
                         if let Some(car) = world.elevator_mut(eid) {
                             car.phase = ElevatorPhase::DoorOpening;
                             car.door = crate::door::DoorState::request_open(
