--- crates/elevator-sim-core/src/systems/loading.rs
+++ replace <= with > in collect_actions
@@ -109,17 +109,17 @@
                 && prefs.skip_full_elevator
                 && load_ratio > prefs.max_crowding_factor
             {
                 if preference_rejected.is_none() {
                     preference_rejected = Some(rid);
                 }
                 return None;
             }
-            if rider.weight <= remaining_capacity {
+            if rider.weight > /* ~ changed by cargo-mutants ~ */ remaining_capacity {
                 Some((rid, rider.weight))
             } else {
                 if rejected_candidate.is_none() {
                     rejected_candidate = Some(rid);
                 }
                 None
             }
         });
