--- crates/elevator-sim-core/src/systems/loading.rs
+++ replace != with == in apply_actions
@@ -159,17 +159,17 @@
                 rider,
                 elevator,
                 stop,
             } => {
                 // Guard: skip if rider is no longer Riding this elevator (another
                 // elevator may have already alighted them in an earlier action).
                 if world
                     .rider(rider)
-                    .is_none_or(|r| r.phase != RiderPhase::Riding(elevator))
+                    .is_none_or(|r| r.phase == /* ~ changed by cargo-mutants ~ */ RiderPhase::Riding(elevator))
                 {
                     continue;
                 }
                 let rider_weight = world.rider(rider).map_or(0.0, |rd| rd.weight);
                 if let Some(car) = world.elevator_mut(elevator) {
                     car.riders.retain(|r| *r != rider);
                     car.current_load = (car.current_load - rider_weight).max(0.0);
                 }
