--- crates/elevator-sim-core/src/systems/movement.rs
+++ delete match arm ElevatorPhase::MovingToStop(stop_eid) in run
@@ -13,17 +13,17 @@
     let elevator_ids = world.elevator_ids();
 
     for eid in elevator_ids {
         if world.is_disabled(eid) {
             continue;
         }
         let target_stop_eid = match world.elevator(eid) {
             Some(car) => match car.phase {
-                ElevatorPhase::MovingToStop(stop_eid) => stop_eid,
+                 /* ~ changed by cargo-mutants ~ */
                 _ => continue,
             },
             None => continue,
         };
 
         let target_pos = world.stop_position(target_stop_eid).unwrap_or(0.0);
         let pos = world.position(eid).map_or(0.0, |p| p.value);
         let vel = world.velocity(eid).map_or(0.0, |v| v.value);
