--- crates/elevator-sim-core/src/systems/movement.rs
+++ delete ! in run
@@ -47,17 +47,17 @@
             p.value = new_pos;
         }
         if let Some(v) = world.velocity_mut(eid) {
             v.value = result.velocity;
         }
 
         // Emit PassingFloor for any stops crossed between old and new position
         // (excluding the target stop — that gets an ElevatorArrived instead).
-        if !result.arrived {
+        if  /* ~ changed by cargo-mutants ~ */result.arrived {
             let moving_up = new_pos > old_pos;
             let (lo, hi) = if moving_up {
                 (old_pos, new_pos)
             } else {
                 (new_pos, old_pos)
             };
             if let Some(sorted) = world.resource::<SortedStops>() {
                 let start = sorted.0.partition_point(|&(p, _)| p <= lo + 1e-9);
